// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б
const rectangle = (a,b) => a * 2 + b * 2;
console.log(rectangle(10, 5));
//---------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу кола з радіусом r
const circle = r => Math.PI * r * r;
console.log(circle(5));
//---------------------------------------------------------------------------------------------------------------------
// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r
const cylinder = (r,h) => 2 * Math.PI * r * (r + h);
console.log(cylinder(5,4));
//---------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив та виводить кожен його елемент
const modules = ['html', 'css', 'js', 'mysql', 'mongodb', 'react', 'angular', 'aws', 'docker', 'git', 'node.js', 'python', 'java'];
const itar_arr = arr => {
    for (const arrElement of arr) {
        console.log(arrElement)
    }
}
itar_arr(modules)
//---------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює параграф з текстом. Текст задати через аргумент
const paragraph = text => document.write(`<p>${text}</p>`);
paragraph('Lorem ipsum dolor sit amet.')
//---------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий
const createList_3li = text => document.write(`<ul><li>${text}</li><li>${text}</li><li>${text}</li></ul>`);
createList_3li('Lorem ipsum.')
//---------------------------------------------------------------------------------------------------------------------
// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий. Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)
const createList_countli = (text,count) => {
    document.write(`<ul>`);
    for (let i = 0; i < count; i++) {
        document.write(`<li>${text}</li>`);
    }
    document.write(`</ul>`);
}
createList_countli('Lorem ipsum dolor sit.',5);
//---------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список
const createList_arr = arr => {
    document.write(`<ul>`);
    for (const arrElement of arr) {
        document.write(`<li>${arrElement}</li>`);
    }
    document.write(`</ul>`);
}
createList_arr(modules)
//---------------------------------------------------------------------------------------------------------------------
// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ.
//   Для кожного об'єкту окремий блок.
const users = [
    {id: 1, name: 'vasya', age: 31},
    {id: 2, name: 'petya', age: 30},
    {id: 3, name: 'kolya', age: 29},
    {id: 4, name: 'olya', age: 28},
    {id: 5, name: 'max', age: 30},
    {id: 6, name: 'anya', age: 31},
    {id: 7, name: 'oleg', age: 28},
    {id: 8, name: 'andrey', age: 29},
    {id: 9, name: 'masha', age: 30},
    {id: 10, name: 'olya', age: 31},
    {id: 11, name: 'max', age: 32}
];

const arr_list = arr => {
    for (const arrElement of arr) {
        document.write(`<div>Id: ${arrElement.id} <br> Name: ${arrElement.name} <br> Age: ${arrElement.age} <br><br></div>`)
    }
}
arr_list(users)
//---------------------------------------------------------------------------------------------------------------------
// - створити функцію яка повертає найменьше число з масиву
const numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9];
const arr_minNumber = arr => {

}
//---------------------------------------------------------------------------------------------------------------------
// - створити функцію sum(arr)яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад sum([1,2,10]) //->13
// - створити функцію swap(arr,index1,index2). Функція міняє місцями заняення у відаовідних індексах
// Приклад  swap([11,22,33,44],0,1) //=> [22,11,33,44]
// - Написати функцію обміну валюти exchange(sumUAH,currencyValues,exchangeCurrency)
// Приклад exchange(10000,[{currency:'USD',value:40},{currency:'EUR',value:42}],'USD') // => 250