// --створити масив з:
//---------------------------------------------------------------------------------------------------------------------
// - з 5 числових значень
//---------------------------------------------------------------------------------------------------------------------
const numbers = [];
for (let i = 0; i < 5; i++) {
    numbers[i] = i + 1;
}
console.log(numbers)
//---------------------------------------------------------------------------------------------------------------------
// - з 5 стічкових значень
//---------------------------------------------------------------------------------------------------------------------
const strings = [];
for (let i2 = 0; i2 < 5; i2++) {
    strings[i2] = 'string' + (i2 + 1);
}
console.log(strings)
//---------------------------------------------------------------------------------------------------------------------
// - з 5 значень стрічкового, числового та булевого типу
// - та вивести його в консоль
//---------------------------------------------------------------------------------------------------------------------
const values = [];
for (let i3 = 0; i3 < 5; i3++) {
    if (i3 % 3 === 0) {
        values[i3] = 'string' + i3;
    } else if (i3 % 3 === 1) {
        values[i3] = i3;
    } else {
        values[i3] = i3 % 2 === 0;
    }
}
console.log(values);
//---------------------------------------------------------------------------------------------------------------------
// -- Створити пустий масив. Наповнити його будь-якими значеннями звертаючись до конкретного індексу. Вивести в консоль
//---------------------------------------------------------------------------------------------------------------------
const values2 = [];
for (let i4 = 0; i4 < 5; i4++) {
    values2[i4] = i4 * 2;
}
console.log(values2);
//---------------------------------------------------------------------------------------------------------------------
// - є масив
const numbers2 = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// 1. перебрати його циклом while
//---------------------------------------------------------------------------------------------------------------------
let i5 = 0;
while (i5 < numbers2.length) {
    console.log(numbers2[i5])
    i5++
}
//---------------------------------------------------------------------------------------------------------------------
// 2. перебрати його циклом for
//---------------------------------------------------------------------------------------------------------------------
for (const number2 of numbers2) {
    console.log(number2)
}
//---------------------------------------------------------------------------------------------------------------------
// 3. перебрати циклом while та вивести  числа тільки з непарним індексом
//---------------------------------------------------------------------------------------------------------------------
let i6 = 0;
while (i6 < numbers2.length){
    if (i6 % 2 !== 0){
        console.log(numbers2[i6])
    }
    i6++;
}
//---------------------------------------------------------------------------------------------------------------------
// 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// 5. перебрати циклом while та вивести  числа тільки парні  значення
// 6. перебрати циклом for та вивести  числа тільки парні  значення
// 7. замінити кожне число кратне 3 на слово "okten"
// 8. вивести масив в зворотньому порядку.
// 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
//
// - Створити масив з 10 числових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 строкрових елементів. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів будь-якого типу. Вивести в консоль всі його елементи в циклі.
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки булеві елементи
// - Створити масив з 10 елементів числового, стірчкового і булевого типу. За допомогою if та typeof вивести тільки числові елементи
// - Створити масив з 10 елементів числового, стрічкового і булевого типу. За допомогою if та typeof вивести тільки рядкові елементи
//
// - Створити порожній масив. Наповнити його 10 елементами (різними за типами) через звернення до конкретних індексів. Вивести в консоль всі його елементи в циклі.
// - Створити цикл for на 10  ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 1. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій з кроком 2. Вивести поточний номер кроку через console.log та document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки парні кроки. через console.log + document.write
// - Створити цикл for на 100 ітерацій. Вивести тільки непарні кроки. через console.log + document.write
//
//
//
// стоврити масив книжок (назва, кількість сторінок, автори , жанри).
// -знайти наібльшу книжку.
// - знайти книжку/ки з найбільшою кількістю жанрів
// - знайти книжку/ки з найдовшою назвою
// - знайти книжку/ки які писали 2 автори
// - знайти книжку/ки які писав 1 автор
